# Data Manipulation and Preparation with Pandas
_Week 3_

In [3]:
# Loading the dataset
import pandas
df = pandas.read_csv('netherlands_IT_salaries.csv')

## Sorting Data

- Sort the dataset by Salary in descending order
- Sort by City and then by Role, both in ascending order

#TODO MEGAN

In [ ]:
#TODO
import pandas as pd

df = pd.read_excel('netherlands_IT_salaries.xlsx')
descending = df.sort_values(by='Salary',ascending=False)

city = df.sort_values(by='City',ascending=True)
role = df.sort_values(by='Role',ascending=True)

,Year,Age,Role,City,Education,Experience,Salary
583,2020,39,Solution Architect,Randstad,HBO,21.0,11137.0
135,2019,38,Solution Architect,Randstad,HBO,20.0,10780.0
24,2018,32,Integration consultant,Randstad,HBO,8.0,10000.0
126,2019,40,Manager Business Development,NaN,WO,16.0,9100.0
1100,2021,25,Lead Developer,NaN,HBO,10.0,9083.0
...,...,...,...,...,...,...,...
961,2021,35,IT Manager,Randstad,WO,9.0,NaN
983,2021,32,System Engineer,Den Haag,MBO,11.0,NaN
1001,2021,31,Data Governance Officer,Amsterdam,IT,7.0,NaN
1004,2021,31,Software Engineer,Randstad,HBO,9.0,NaN
1050,2021,28,Software Engineer,NaN,HBO,6.0,NaN

## Handling Missing Data

· Check if there are any missing values in each column.

· Display only the rows with missing values.

· Fill missing Education values with 'Unknown'.

· Replace missing Salary values (if any) with the average salary.

· Drop rows where City is missing.

· Decide what to do with missing values in Experience.

In [5]:
#TODO
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1134 entries, 0 to 1133
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        1134 non-null   int64
 1   Age         1134 non-null   int64
 2   Role        1134 non-null   object
 3   City        877 non-null    object
 4   Education   1070 non-null   object
 5   Experience  1130 non-null   float64
 6   Salary      1101 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 62.1+ KB

In [8]:
#TODO
df_missing = df[df.isna().any(axis=1)]
print(df_missing)

      Year  Age                 Role    City Education  Experience  Salary
2     2018   42        BI Consultant     NaN       MBO        25.0  4400.0
6     2018   38    Software Engineer     NaN       HBO        11.0  3350.0
10    2018   36       Lead Developer  Arnhem       NaN        16.0  4100.0
14    2018   36        Web Developer     NaN        WO         3.0  2100.0
18    2018   34       Cloud Engineer     NaN       HBO        15.0  5150.0
...    ...  ...                  ...     ...       ...         ...     ...
1120  2021   24  Front-end Developer     NaN       HBO         0.0  2600.0
1121  2021   24       Lead Developer     NaN       NaN         6.0  7679.0
1122  2021   24    Software Engineer     NaN       HBO         2.0  2600.0
1127  2021   23   Low Code Developer     NaN       HBO         2.0  3700.0
1128  2021   23   Helpdeskmedewerker     NaN       MBO         0.0  2550.0

[327 rows x 7 columns]

In [12]:
#TODO
df['Education'].fillna('Unknown', inplace=True)
df

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

In [13]:
#TODO
df['Salary'].fillna(df['Salary'].mean(), inplace=True)

df

C:\Users\megan\AppData\Local\Temp\ipykernel_42336\122011522.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

In [11]:
#TODO
df.dropna(subset=['City'])
df

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

In [10]:
#TODO
df['Experience'].fillna(df['Experience'].mean(), inplace=True)

df

C:\Users\megan\AppData\Local\Temp\ipykernel_42336\1034986529.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Experience'].fillna(df['Experience'].mean(), inplace=True)

      Year  Age                  Role       City Education  Experience  Salary
0     2018   47       Helpdeskmanager  Apeldoorn       HBO        25.0  4950.0
1     2018   42   Applicatiebeheerder     Almelo      HAVO        10.0  4086.0
2     2018   42         BI Consultant        NaN       MBO        25.0  4400.0
3     2018   39     Software Engineer  Amsterdam       MBO         6.0  3600.0
4     2018   38         IT Consultant     Mierlo       HBO        15.0  4900.0
...    ...  ...                   ...        ...       ...         ...     ...
1129  2021   23        Data Scientist   Randstad        WO         0.0  3750.0
1130  2021   23  System Administrator     Arnhem       MBO         0.0  2375.0
1131  2021   22     Software Engineer    Hengelo       HBO         0.0  2850.0
1132  2021   22     Software Engineer     Arnhem       HBO         0.0  2500.0
1133  2021   21     Software Engineer      Breda       MBO         1.0  2385.0

[1134 rows x 7 columns]

## Removing Duplicates


· Check if there are any duplicate rows.

· If duplicates exist, remove them while keeping only the first occurrence.

In [ ]:
#TODO PAUL

is_duplicated = df.duplicated().any()
print(is_duplicated)

In [ ]:
#TODO PAUL
df.drop_duplicates(inplace=True)

# Detecting Outliers

· Use the Interquartile Range (IQR) method to identify potential outliers in Salary.

· Display the rows containing salary outliers.

· Remove detected outliers from the dataset.

In [ ]:
#TODO PAUL
Q1 = df["Salary"].quantile(0.25)
Q3 = df["Salary"].quantile(0.75)
IQR = Q3 - Q1
Outliers = df[(df["Salary"] < (Q1 - 1.5 * IQR)) | (df["Salary"] > (Q3 + 1.5 * IQR))]

In [ ]:
#TODO PAUL
print(Outliers)

In [ ]:
#TODO PAUL
for i in Outliers.index:
    df.drop(i, inplace=True)

# GroupBy Operations

· Group the data by City and calculate:

o The average salary in each city.

o The number of roles in each city.

· Group the data by Education and find the maximum salary for each education level.

· Group the data by Seniority and find the median salary for each seniority level.

In [ ]:
# TODO

In [ ]:
# TODO

In [ ]:
# TODO

# Apply and Map Functions

· Add a new column Annual Salary by applying a function to calculate Salary x 12.

· Use the .map() function to categorize education levels into 'Low', 'Medium', and 'High':

o       MBO, Mavo, and Unknown → 'Low'

o       HBO → 'Medium'

o       WO → 'High'

o       Store the new values in a column called Education Level.

In [ ]:
#TODO

In [ ]:
#TODO

# Feature Engineering

· Create a new column Year of Birth using the formula: Year - Age.

· Create a new column Seniority based on experience:

o Less than 5 years → 'Junior'

o Between 5 and 10 years → 'Mid-level'

o More than 10 years → 'Senior'

· Create a new column City Category:

o If the city is 'Randstad', 'Amsterdam', or 'Utrecht', categorize it as 'Urban'.

o Otherwise, categorize it as 'Non-Urban'.

· Create a new column Salary Bracket based on salary:

o Less than €3000 → 'Low'

o Between €3000 and €5000 → 'Medium'

o More than €5000 → 'High'.

In [ ]:
#TODO

In [ ]:
#TODO

In [ ]:
#TODO

In [ ]:
#TODO

# Advanced Analysis

· Find the top 5 highest-paying roles.

· Find the most common role in the dataset.

In [ ]:
#TODO

In [ ]:
#TODO

# Save the Cleaned Data

· Save the final cleaned dataset to a CSV file named cleaned_IT_salaries.csv.

In [ ]:
#TODO